#+TITLE: Catamorfism, ScalaCheck
#+AUTHOR: Evgeny Kurnevsky
#+DATE: September 21, 2017
#+OPTIONS: num:nil toc:nil reveal_width:1200 reveal_height:800

* Generate examples

#+BEGIN_SRC scala
ExprGen.expr.sample.map(ExprF.print)
#+END_SRC

#+RESULTS:
: Some(-28/(-((+89-(93))+(39/(+83)/1)+89-(-21+25*(70-67/46/53))))/(47))

* Shrink example

#+BEGIN_SRC scala
import atto.syntax.parser._
val expr = ExprF.Parser.expr.parseOnly("-(1+2)*3+6").option
expr.map(ExprGen.shrink.shrink).map(_.map(ExprF.print).toList)
#+END_SRC

#+RESULTS:
: Some(List(-(1+2)*3, 6, -(1+2), 3, (1+2), 1+2, 1, 2, 0, 1, 0, 1, 0, 3, 1, 0))

